In [1]:
import pandas as pd
import numpy as np

In [6]:
data = {
    "names" : ["Sachin","Sehwag","Dhoni","Kohli","Bumrah","Ishant"],
    "avg" : [48.54,45.55,50.12,54.33,10.92,12]
}

In [7]:
pd.Series(data['names'])

0    Sachin
1    Sehwag
2     Dhoni
3     Kohli
4    Bumrah
5    Ishant
dtype: object

In [9]:
df = pd.DataFrame(data)

In [10]:
df

    names    avg
0  Sachin  48.54
1  Sehwag  45.55
2   Dhoni  50.12
3   Kohli  54.33
4  Bumrah  10.92
5  Ishant  12.00

In [11]:
df.shape

(6, 2)

In [15]:
# first 5 observations
# df.head()

# first 2 observations
df.head(2)

    names    avg
0  Sachin  48.54
1  Sehwag  45.55

In [13]:
# last 5 observations
df.tail()

    names    avg
1  Sehwag  45.55
2   Dhoni  50.12
3   Kohli  54.33
4  Bumrah  10.92
5  Ishant  12.00

In [16]:
df.columns

Index(['names', 'avg'], dtype='object')

In [17]:
df.describe()

             avg
count   6.000000
mean   36.910000
std    19.919112
min    10.920000
25%    20.387500
50%    47.045000
75%    49.725000
max    54.330000

In [25]:
df['runs'] = np.array([15500,8900,10002,11220,1200,560])

In [26]:
df

    names    avg   runs
0  Sachin  48.54  15500
1  Sehwag  45.55   8900
2   Dhoni  50.12  10002
3   Kohli  54.33  11220
4  Bumrah  10.92   1200
5  Ishant  12.00    560

In [27]:
df.describe()

             avg          runs
count   6.000000      6.000000
mean   36.910000   7897.000000
std    19.919112   5881.604373
min    10.920000    560.000000
25%    20.387500   3125.000000
50%    47.045000   9451.000000
75%    49.725000  10915.500000
max    54.330000  15500.000000

In [28]:
df['avg'] >= 50

0    False
1    False
2     True
3     True
4    False
5    False
Name: avg, dtype: bool

In [29]:
df[df['avg'] >= 50]

   names    avg   runs
2  Dhoni  50.12  10002
3  Kohli  54.33  11220

In [30]:
df[df['runs'] >= 10000]

    names    avg   runs
0  Sachin  48.54  15500
2   Dhoni  50.12  10002
3   Kohli  54.33  11220

In [33]:
df[(df['runs'] >= 10000) & (df['avg'] >= 50)]

   names    avg   runs
2  Dhoni  50.12  10002
3  Kohli  54.33  11220

In [35]:
df[0:3]

    names    avg   runs
0  Sachin  48.54  15500
1  Sehwag  45.55   8900
2   Dhoni  50.12  10002

In [36]:
df.loc[0]

names    Sachin
avg       48.54
runs      15500
Name: 0, dtype: object

In [37]:
df.loc[0:2]

    names    avg   runs
0  Sachin  48.54  15500
1  Sehwag  45.55   8900
2   Dhoni  50.12  10002

In [38]:
df.iloc[0]

names    Sachin
avg       48.54
runs      15500
Name: 0, dtype: object

In [39]:
df.iloc[0:2]

    names    avg   runs
0  Sachin  48.54  15500
1  Sehwag  45.55   8900

In [40]:
df.iloc[0:2,0:2]

    names    avg
0  Sachin  48.54
1  Sehwag  45.55

In [41]:
df.iloc[0:2,[0,2]]

    names   runs
0  Sachin  15500
1  Sehwag   8900